In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas) (2025.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas) (2025.2)
Requirement already satisfied: numpy>=1.22.4 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas) (2.0.2)
Requirement already satisfied: six>=1.5 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

WARNING: You are using pip version 22.0.4; however, version 25.1.1 is available.
You should consider upgrading via the 'C:\Users\IDEAL INFO\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip' command.

In [ ]:
import pandas as pd

In [ ]:
#a list of number 
numbers =[1,2,3,4,5]

In [ ]:
#create a series from the list . 
# series is a list with an index .   
#dtype: return the type of data our series is .
# our index is going to start at 0
pd.Series(numbers)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
#create a lis of char 
# we create this object , we can now enter it as a data point .
letters =["a","b","c","d","e"]

In [ ]:
# we have the letters as the data , and for the index we can insert the numbers. 
#we will have the data type as object since strings are considered objects .
# our index is going to start at 1 
#letters and numbers should be same lengths .
pd.Series(data=letters, index=numbers)

1    a
2    b
3    c
4    d
5    e
dtype: object

In [ ]:
#the type of data is object 
# i created an index with my personal labels , that will works as an index 
pd.Series(data=letters, index=['letter1 ','letter2' ,'letter3','letter4','letter5'])

letter1     a
letter2     b
letter3     c
letter4     d
letter5     e
dtype: object

In [20]:
# i created a dictionary of data 
data ={'name':'Luigi', 'age':26 , 'work':'employed'}

In [21]:
pd.Series(data=data)

name       Luigi
age           26
work    employed
dtype: object

In [22]:
numbers=[1,2,3,4,5] #  a list of numbers 
letters=['a','b','c','d','e'] # a list of letters

In [ ]:
# create a series  of number (list indexed )
# the data type is integer 
number_series =pd.Series(numbers)
number_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
# create a series  of number (list indexed )
# the data type is object 
letter_series=pd.Series(letters)
letter_series #variable

0    a
1    b
2    c
3    d
4    e
dtype: object

In [ ]:
# the attribute dtype return the data type of that series  
number_series.dtype

dtype('int64')

In [ ]:
#the letter_series contains strings 
# in this step , dtype going to return 'o' which stand for object . 
letter_series.dtype

dtype('O')

In [ ]:
# the attribute .value will return an array of type object and it contains these strings 
letter_series.values

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [32]:
number_series.values

array([1, 2, 3, 4, 5])

In [35]:
#.index returns information about the index 
#the rslt going to say that this is a range index since it starts from 0 and stops at 5 with a step of one 
letter_series.index

RangeIndex(start=0, stop=5, step=1)

In [42]:
# in this step we create onether series list which have a none value 
incomplete_series=pd.Series(data=['a','b',None] , index=[1,2,3])
incomplete_series

1       a
2       b
3    None
dtype: object

In [43]:
#the .hasnans attribute check if we have a none value in series list or no 
# if we have , will return true 
# if we don't have a none or null value will receive false 

incomplete_series.hasnans

True

In [ ]:
#.shape return the shape of series as a tuple (5 lines,1 column) , and usually we used with dataframes
# we got (5,) because it only has one column
number_series.shape

(5,)

In [ ]:
# .size return the size of the series 
#since it contains 5 elements, it's going to return 5 
number_series.size

5

In [50]:
#we need to know the size of letter series  
letter_series.size

5

In [52]:
#we use the methods 
values= pd.Series(data=[1.5, 2.5, 0.5, None, 4.0, 1.0])

In [ ]:
# the method .max() return the maximum value in this list 
values.max()

np.float64(4.0)

In [55]:
# the method .min() return the mainimum value in this list 
values.min()

np.float64(0.5)

In [57]:
# the method .sum() return the sum of  this values 
values.sum()

np.float64(9.5)

In [58]:
 # the method .mean () return the average  in this list 
values.mean()

np.float64(1.9)

In [61]:
# .idxmax() get the index of the max value of the series 
values.idxmax()

4

In [ ]:
# .idxmax() get the index of the max value of the series 
# NB : index start from 0 
values.idxmin()

2

In [ ]:
# .isnull return  wich value is null 
# the third value in this series is  null 
#the type pf result is boolean , True or False 
values.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [ ]:
#.round() each value in the series 
#round the decimals 
values.round()

0    1.5
1    2.5
2    0.5
3    NaN
4    4.0
5    1.0
dtype: float64

In [85]:
#how we read a csv file 
#riches is a variable and  we're calling a pd.read csv as the first argument is the path to csv file , usecols means which column you need ,
#  .squeeze() that's mean convert this column to a series (list indexed) .
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name']).squeeze()
richest

0                     Elon Musk
1                    Jeff Bezos
2      Bernard Arnault & family
3                    Bill Gates
4                Warren Buffett
                 ...
96             Vladimir Potanin
97         Harold Hamm & family
98                 Sun Piaoyang
99           Luo Liguo & family
100                   Peter Woo
Name: Name, Length: 101, dtype: object

In [84]:
type(richest)

pandas.core.series.Series

In [90]:
#create  another csv files named test.csv
#we eliminate the index column with index=False 
richest.to_csv('test.csv', index=False )

In [97]:
#squeeze() is just to convert to indexed list(series list )
name_of_people= pd.read_csv('test.csv').squeeze()
name_of_people

0                     Elon Musk
1                    Jeff Bezos
2      Bernard Arnault & family
3                    Bill Gates
4                Warren Buffett
                 ...
96             Vladimir Potanin
97         Harold Hamm & family
98                 Sun Piaoyang
99           Luo Liguo & family
100                   Peter Woo
Name: Name, Length: 101, dtype: object

In [99]:
#we need to know the type of object name_of_people 
#if we eliminate .squeez() in the last query, we got a dataframe as a type of name_of_people 
type(name_of_people)

pandas.core.series.Series

In [ ]:
#read a csv file 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv')
richest

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
...,...,...,...,...,...,...
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

In [ ]:
#variable.head(10) return the 10 first rows (10 excluded )
richest.head(10)

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
5,Larry Page,"$111,000,000,000",49,United States,Google,Technology
6,Sergey Brin,"$107,000,000,000",48,United States,Google,Technology
7,Larry Ellison,"$106,000,000,000",77,United States,software,Technology
8,Steve Ballmer,"$91,400,000,000",66,United States,Microsoft,Technology
9,Mukesh Ambani,"$90,700,000,000",64,India,diversified,Diversified

In [ ]:


#variable.head(-10) , eliminate the 10 final rows : we are missing 10 rows ;
richest.head(-10)

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
...,...,...,...,...,...,...
86,Vladimir Lisin,"$18,400,000,000",65,Russia,"steel, transport",Metals & Mining
87,Fan Hongwei & family,"$18,200,000,000",55,China,petrochemicals,Energy
88,Lakshmi Mittal,"$17,900,000,000",71,India,steel,Metals & Mining
89,Andrew Forrest,"$17,800,000,000",60,Australia,mining,Metals & Mining
90,Jiang Rensheng & family,"$17,700,000,000",68,China,vaccines,Healthcare

In [ ]:
#.tail(10) : return the last 10 rows from our dataset 
richest.tail(10)

,Name,NetWorth,Age,Country/Territory,Source,Industry
91,Savitri Jindal & family,"$17,700,000,000",72,India,steel,Metals & Mining
92,Wang Wenyin,"$17,700,000,000",54,China,"mining, copper products",Metals & Mining
93,Li Xiting,"$17,600,000,000",71,Singapore,medical devices,Healthcare
94,Stefan Persson,"$17,600,000,000",74,Sweden,H&M,Fashion & Retail
95,Steve Cohen,"$17,400,000,000",65,United States,hedge funds,Finance & Investments
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

In [110]:
#.tail(-10) : eliminate the  first 10 rows from our dataset 
# we exclude the 10 first element 
richest.tail(-10)

,Name,NetWorth,Age,Country/Territory,Source,Industry
10,Gautam Adani & family,"$90,000,000,000",59,India,"infrastructure, commodities",Diversified
11,Michael Bloomberg,"$82,000,000,000",80,United States,Bloomberg LP,Media & Entertainment
12,Carlos Slim Helu & family,"$81,200,000,000",82,Mexico,telecom,Telecom
13,Francoise Bettencourt Meyers & family,"$74,800,000,000",68,France,L'Oréal,Fashion & Retail
14,Mark Zuckerberg,"$67,300,000,000",37,United States,Facebook,Technology
...,...,...,...,...,...,...
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

In [ ]:
#just for reading a csv file and we choice the column of names such as a series 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name']).squeeze()
richest

0                     Elon Musk
1                    Jeff Bezos
2      Bernard Arnault & family
3                    Bill Gates
4                Warren Buffett
                 ...
96             Vladimir Potanin
97         Harold Hamm & family
98                 Sun Piaoyang
99           Luo Liguo & family
100                   Peter Woo
Name: Name, Length: 101, dtype: object

In [126]:
# is used for dataframes because dataframes have two axes , axis by default =0 , then we choce to sort it ascending order .
#kind of algorithme it should use for sorting 
#na_position : the null values we can placed in last or first 
# with ignore_index we can eliminate the index for exmpl '74' for the abigail and will be the first with 0 index  
richest.sort_values(axis=0,  ascending=True , kind='quicksort' , na_position='last', ignore_index=True )

0           Abigail Johnson
1          Alain Wertheimer
2              Alice Walton
3            Amancio Ortega
4            Andrew Forrest
               ...
96           Warren Buffett
97         William Lei Ding
98     Yang Huiyan & family
99             Zhang Yiming
100          Zhong Shanshan
Name: Name, Length: 101, dtype: object

In [128]:
#we sort the data from his index in the ascending order 
richest.sort_index(ascending=False )

100          Zhong Shanshan
99             Zhang Yiming
98     Yang Huiyan & family
97         William Lei Ding
96           Warren Buffett
               ...
4            Andrew Forrest
3            Amancio Ortega
2              Alice Walton
1          Alain Wertheimer
0           Abigail Johnson
Name: Name, Length: 101, dtype: object

In [ ]:
#just for reading a csv file and we choice the column of industry  such as a series 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Industry']).squeeze()
richest

0                 Automotive
1                 Technology
2           Fashion & Retail
3                 Technology
4      Finance & Investments
               ...
96           Metals & Mining
97                    Energy
98                Healthcare
99             Manufacturing
100              Real Estate
Name: Industry, Length: 101, dtype: object

In [ ]:
#in this step .value_counts() going to count each one of the values in column industry because we have a lot of different industries and 
#some are repeating , So the most common or the most repeated industry is the fashion & retail, and that occurred 18 times ...
#sort=true : from the highest frequency to the lowest frequency 
#we can use dropona=True , if we have anything not a number , it's going to drop those . 
richest.value_counts(sort=True)

Industry
Fashion & Retail         18
Technology               15
Finance & Investments    13
Metals & Mining           9
Food & Beverage           8
Automotive                7
Diversified               6
Manufacturing             5
Healthcare                5
Media & Entertainment     4
Real Estate               3
Telecom                   2
Logistics                 2
Energy                    2
Gambling & Casinos        1
Service                   1
Name: count, dtype: int64

In [ ]:
#just for reading a csv file and we choice the column of age such as a series 
#we have all the ages in our database 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Age']).squeeze()
richest

0      50
1      58
2      73
3      66
4      91
       ..
96     61
97     76
98     63
99     66
100    75
Name: Age, Length: 101, dtype: int64

In [150]:
#.value_counts(bins=5) that's means we're going to get  five bins back . And essentially it created groups for us . 
#for exemple there are 5 people within the age group of 29.9 to 42.8 
# and we have 17 people in the range of 42.8 to 55.6 ...
#but that only works with numerical data 

richest.value_counts(bins=5)

(55.6, 68.4]      33
(68.4, 81.2]      27
(81.2, 94.0]      19
(42.8, 55.6]      17
(29.935, 42.8]     5
Name: count, dtype: int64

In [151]:
#just for reading a csv file and we choice the column of name such as a series 
#we have all the names  in our database 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name']).squeeze()
richest

0                     Elon Musk
1                    Jeff Bezos
2      Bernard Arnault & family
3                    Bill Gates
4                Warren Buffett
                 ...
96             Vladimir Potanin
97         Harold Hamm & family
98                 Sun Piaoyang
99           Luo Liguo & family
100                   Peter Woo
Name: Name, Length: 101, dtype: object

In [ ]:
#get the first 10 elements(names) 
richest.head(10)

0                   Elon Musk
1                  Jeff Bezos
2    Bernard Arnault & family
3                  Bill Gates
4              Warren Buffett
5                  Larry Page
6                 Sergey Brin
7               Larry Ellison
8               Steve Ballmer
9               Mukesh Ambani
Name: Name, dtype: object

In [161]:
#go to access the  element(name) number 10 for exemple .
#accessing an element via its exact position (what you need to know) 
richest[10]

'Gautam Adani & family'

In [159]:
#accessing mulpitle elements with a list of position 
richest[[1,2,15]]

1                   Jeff Bezos
2     Bernard Arnault & family
15                  Jim Walton
Name: Name, dtype: object

In [ ]:
#accessing via slicing .
#you can select from the position 5 for exemple under the position 11 excluded -> you will receive from the 5 position under the 10 position names 
richest[5:11]

5                Larry Page
6               Sergey Brin
7             Larry Ellison
8             Steve Ballmer
9             Mukesh Ambani
10    Gautam Adani & family
Name: Name, dtype: object

In [ ]:
#accessing via slicing with a step 
#you will receive from the position 0 to te position 21 excluded , with 5 step 
richest[0:21:5]

0                 Elon Musk
5                Larry Page
10    Gautam Adani & family
15               Jim Walton
20             Charles Koch
Name: Name, dtype: object

In [ ]:
#accessing evething until 10 (excluded)
richest[:10]

0                   Elon Musk
1                  Jeff Bezos
2    Bernard Arnault & family
3                  Bill Gates
4              Warren Buffett
5                  Larry Page
6                 Sergey Brin
7               Larry Ellison
8               Steve Ballmer
9               Mukesh Ambani
Name: Name, dtype: object

In [170]:
#you muust ceate a list [1,2,3] , and the n [-1] represente , they can get the last element in this list 
[1,2,3][-1]

3

In [ ]:
#get the last element (name) 
# in our database 
richest[-1:]

100    Peter Woo
Name: Name, dtype: object

In [ ]:
#you  can know how our database is indexed , start from 0 to 101 with 1 step 
richest.index

RangeIndex(start=0, stop=101, step=1)

In [ ]:
#just for reading a csv file and we choice 2 column , name and networks  such as a series 
#we're going to have a new series that uses the names as the key and the networth as the values 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name','NetWorth'], index_col='Name').squeeze()
richest

Name
Elon Musk                   $219,000,000,000
Jeff Bezos                  $171,000,000,000
Bernard Arnault & family    $158,000,000,000
Bill Gates                  $129,000,000,000
Warren Buffett              $118,000,000,000
                                  ...
Vladimir Potanin             $17,300,000,000
Harold Hamm & family         $17,200,000,000
Sun Piaoyang                 $17,100,000,000
Luo Liguo & family           $17,000,000,000
Peter Woo                    $17,000,000,000
Name: NetWorth, Length: 101, dtype: object

In [182]:
richest[0]

C:\Users\IDEAL INFO\AppData\Local\Temp\ipykernel_22260\3734245380.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  richest[0]

'$219,000,000,000'

In [ ]:
#accessing a single element indexed bill gates , and we got the networth of this index 
richest['Bill Gates']

'$129,000,000,000'

In [ ]:
#accessing multiple element 
#accessing to 2 element 

richest[['Bill Gates','Warren Buffett']]

Name
Bill Gates        $129,000,000,000
Warren Buffett    $118,000,000,000
Name: NetWorth, dtype: object

In [ ]:
#slicing via index 
#we want to find out what's between Bill Gates and Steve Ballmer 
richest['Bill Gates':'Steve Ballmer']

Name
Bill Gates        $129,000,000,000
Warren Buffett    $118,000,000,000
Larry Page        $111,000,000,000
Sergey Brin       $107,000,000,000
Larry Ellison     $106,000,000,000
Steve Ballmer      $91,400,000,000
Name: NetWorth, dtype: object

In [187]:
#will still give us 2 elements back Elon and Jeff   
richest [0:2]

Name
Elon Musk     $219,000,000,000
Jeff Bezos    $171,000,000,000
Name: NetWorth, dtype: object

In [ ]:
#.index , give you all the index are used ( much larger indexer are used in this situation is names )
richest.index

Index(['Elon Musk', 'Jeff Bezos', 'Bernard Arnault & family', 'Bill Gates',
       'Warren Buffett', 'Larry Page', 'Sergey Brin', 'Larry Ellison',
       'Steve Ballmer', 'Mukesh Ambani',
       ...
       'Savitri Jindal & family', 'Wang Wenyin', 'Li Xiting', 'Stefan Persson',
       'Steve Cohen', 'Vladimir Potanin', 'Harold Hamm & family',
       'Sun Piaoyang', 'Luo Liguo & family', 'Peter Woo'],
      dtype='object', name='Name', length=101)

In [208]:
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name','Age'], index_col='Name').squeeze()
richest

Name
Elon Musk                   50
Jeff Bezos                  58
Bernard Arnault & family    73
Bill Gates                  66
Warren Buffett              91
                            ..
Vladimir Potanin            61
Harold Hamm & family        76
Sun Piaoyang                63
Luo Liguo & family          66
Peter Woo                   75
Name: Age, Length: 101, dtype: int64

In [194]:
#find wich person is the oldest
oldest= richest.idxmax() 
oldest

'Lee Shau Kee'

In [196]:
#how old is he 
richest[oldest]

np.int64(94)

In [ ]:
#sor the values from the oldest to youngest age to verify 
x=richest.sort_values( ascending=False ) 
x

Name
Lee Shau Kee               94
Li Ka-shing                93
Warren Buffett             91
Rupert Murdoch & family    91
Leonard Lauder             89
                           ..
Yang Huiyan & family       40
Guillaume Pousaz           40
Zhang Yiming               38
Mark Zuckerberg            37
Sam Bankman-Fried          30
Name: Age, Length: 101, dtype: int64

In [ ]:
#which person is the youngest 
youngest=richest.idxmin()
youngest

'Sam Bankman-Fried'

In [ ]:
# how young is the youngest 
richest[youngest]

np.int64(30)

In [ ]:
#the AVG age of all ( round it oo 2 decimal places )
richest.mean().round(2)

np.float64(67.12)

In [225]:
#save the series as a csv file named : sample.csv 
richest.to_csv('sample.csv')

In [228]:
# read the csv you just saved 
pd.read_csv('sample.csv')

                     Name  Age
0          Zhong Shanshan   67
1            Zhang Yiming   38
2    Yang Huiyan & family   40
3        William Lei Ding   50
4          Warren Buffett   91
..                    ...  ...
96         Andrew Forrest   60
97         Amancio Ortega   86
98           Alice Walton   72
99       Alain Wertheimer   73
100       Abigail Johnson   60

[101 rows x 2 columns]

In [230]:
#we create a data 
#we have 3 elements here and we have some nested lists . We have a disctionary with lists inside
#we use dataframe priùarily for efficient and organized handling of tabular data .
data={'a':[100,200,300], 'b':[400,500,600],'c':[700,800,900]}
df= pd.DataFrame(data=data)
df

     a    b    c
0  100  400  700
1  200  500  800
2  300  600  900

In [ ]:
#return to us a series 
df['a']

0    100
1    200
2    300
Name: a, dtype: int64

In [236]:
#How to create a dataframe with onether solution , indexed by first, second , third ; and named by a , b and c 
# a bit more personalized 
df= pd.DataFrame(data=[[100,200,300] , [400,500,600] , [700,800,900 ]] , 
                   index =['First','second','Third '] , 
                   columns=['a','b','c'] )
df

          a    b    c
First   100  200  300
second  400  500  600
Third   700  800  900

In [235]:
df['a']

First     100
second    400
Third     700
Name: a, dtype: int64

In [239]:
df.c

First     300
second    600
Third     900
Name: c, dtype: int64

In [241]:
richest= pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv')
richest

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
...,...,...,...,...,...,...
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

In [ ]:
#.shape return to us that it has 101 rows and 6 columns 
richest.shape

(101, 6)

In [245]:
#return how many element in this dataframe 
richest.size

606

In [247]:
#we can get some information regarding the index and it's a simple range that start from 0 to 101 with 1 step 
richest.index

RangeIndex(start=0, stop=101, step=1)

In [ ]:
#we can also see what kind of columns we have  . it's going to give us all the column and the datatype = object because they are strings 
richest.columns

Index(['Name', 'NetWorth', 'Age', 'Country/Territory', 'Source', 'Industry'], dtype='object')

In [252]:
#that's going to return to us information regarding both the index and the columns .
richest.axes

[RangeIndex(start=0, stop=101, step=1),
 Index(['Name', 'NetWorth', 'Age', 'Country/Territory', 'Source', 'Industry'], dtype='object')]

In [ ]:
#we can also get the data types for each one of the columns 
richest.dtypes

Name                 object
NetWorth             object
Age                   int64
Country/Territory    object
Source               object
Industry             object
dtype: object

In [ ]:
#we can also get some information regarding the values 
#going to return to us all the values in our dataframe as an array 
richest.values

array([['Elon Musk', '$219,000,000,000', 50, 'United States',
        'Tesla, SpaceX', 'Automotive'],
       ['Jeff Bezos', '$171,000,000,000', 58, 'United States', 'Amazon',
        'Technology'],
       ['Bernard Arnault & family', '$158,000,000,000', 73, 'France',
        'LVMH', 'Fashion & Retail'],
       ['Bill Gates', '$129,000,000,000', 66, 'United States',
        'Microsoft', 'Technology'],
       ['Warren Buffett', '$118,000,000,000', 91, 'United States',
        'Berkshire Hathaway', 'Finance & Investments'],
       ['Larry Page', '$111,000,000,000', 49, 'United States', 'Google',
        'Technology'],
       ['Sergey Brin', '$107,000,000,000', 48, 'United States', 'Google',
        'Technology'],
       ['Larry Ellison', '$106,000,000,000', 77, 'United States',
        'software', 'Technology'],
       ['Steve Ballmer', '$91,400,000,000', 66, 'United States',
        'Microsoft', 'Technology'],
       ['Mukesh Ambani', '$90,700,000,000', 64, 'India', 'diversified',
        'Diversified'],
       ['Gautam Adani & family', '$90,000,000,000', 59, 'India',
        'infrastructure, commodities', 'Diversified'],
       ['Michael Bloomberg', '$82,000,000,000', 80, 'United States',
        'Bloomberg LP', 'Media & Entertainment'],
       ['Carlos Slim Helu & family', '$81,200,000,000', 82, 'Mexico',
        'telecom', 'Telecom'],
       ['Francoise Bettencourt Meyers & family', '$74,800,000,000', 68,
        'France', "L'Oréal", 'Fashion & Retail'],
       ['Mark Zuckerberg', '$67,300,000,000', 37, 'United States',
        'Facebook', 'Technology'],
       ['Jim Walton', '$66,200,000,000', 73, 'United States', 'Walmart',
        'Fashion & Retail'],
       ['Zhong Shanshan', '$65,700,000,000', 67, 'China',
        'beverages, pharmaceuticals', 'Food & Beverage'],
       ['Alice Walton', '$65,300,000,000', 72, 'United States',
        'Walmart', 'Fashion & Retail'],
       ['Rob Walton', '$65,000,000,000', 77, 'United States', 'Walmart',
        'Fashion & Retail'],
       ['Changpeng Zhao', '$65,000,000,000', 44, 'Canada',
        'cryptocurrency exchange', 'Finance & Investments'],
       ['Charles Koch', '$60,000,000,000', 86, 'United States',
        'Koch Industries', 'Diversified'],
       ['Julia Koch & family', '$60,000,000,000', 59, 'United States',
        'Koch Industries', 'Diversified'],
       ['Amancio Ortega', '$59,600,000,000', 86, 'Spain', 'Zara',
        'Fashion & Retail'],
       ['Michael Dell', '$55,100,000,000', 57, 'United States',
        'Dell computers', 'Technology'],
       ['Zhang Yiming', '$50,000,000,000', 38, 'China', 'TikTok',
        'Media & Entertainment'],
       ['David Thomson & family', '$49,200,000,000', 64, 'Canada',
        'media', 'Media & Entertainment'],
       ['Phil Knight & family', '$47,300,000,000', 84, 'United States',
        'Nike', 'Fashion & Retail'],
       ['Dieter Schwarz', '$47,100,000,000', 82, 'Germany', 'retail',
        'Fashion & Retail'],
       ['Robin Zeng', '$44,800,000,000', 53, 'Hong Kong', 'batteries',
        'Automotive'],
       ['MacKenzie Scott', '$43,600,000,000', 51, 'United States',
        'Amazon', 'Technology'],
       ['Rodolphe Saadé & family', '$41,400,000,000', 52, 'France',
        'shipping', 'Logistics'],
       ['François Pinault & family', '$40,400,000,000', 85, 'France',
        'luxury goods', 'Fashion & Retail'],
       ['Klaus-Michael Kuehne', '$37,300,000,000', 84, 'Germany',
        'shipping', 'Logistics'],
       ['Ma Huateng', '$37,200,000,000', 50, 'China', 'internet media',
        'Technology'],
       ['Beate Heister & Karl Albrecht Jr. & family', '$36,800,000,000',
        50, 'Germany', 'supermarkets', 'Fashion & Retail'],
       ['Giovanni Ferrero', '$36,200,000,000', 57, 'Italy',
        'Nutella, chocolates', 'Food & Beverage'],
       ['Li Ka-shing', '$34,800,000,000', 93, 'Hong Kong', 'diversified',
        'Diversified'],
       ['Stephen Schwarzman', '$34,800,000,000', 75, 'United States',
        'investments', 'Finance & Investments'],
       ['Lee Shau Kee', '$32,600,000,000', 94, 'Hong Kong',
        'real estate', 'Real Estate'],
       ['Len Blavatnik', '$32,500,000,000', 64, 'United States',
        'music, chemicals', 'Diversified'],
       ['Jacqueline Mars', '$31,700,000,000', 82, 'United States',
        'candy, pet food', 'Food & Beverage'],
       ['John Mars', '$31,700,000,000', 86, 'United States',
        'candy, pet food', 'Food & Beverage'],
       ['Alain Wertheimer', '$31,200,000,000', 73, 'France', 'Chanel',
        'Fashion & Retail'],
       ['Gerard Wertheimer', '$31,200,000,000', 71, 'France', 'Chanel',
        'Fashion & Retail'],
       ['German Larrea Mota Velasco & family', '$30,800,000,000', 68,
        'Mexico', 'mining', 'Metals & Mining'],
       ['Gina Rinehart', '$30,200,000,000', 68, 'Australia', 'mining',
        'Metals & Mining'],
       ['Shiv Nadar', '$28,700,000,000', 76, 'India',
        'software services', 'Technology'],
       ['Jim Simons', '$28,600,000,000', 83, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['He Xiangjian', '$28,300,000,000', 79, 'China',
        'home appliances', 'Manufacturing'],
       ['Miriam Adelson', '$27,500,000,000', 76, 'United States',
        'casinos', 'Gambling & Casinos'],
       ['Dietrich Mateschitz', '$27,400,000,000', 77, 'Austria',
        'Red Bull', 'Food & Beverage'],
       ['Leonardo Del Vecchio & family', '$27,300,000,000', 86, 'Italy',
        'eyeglasses', 'Fashion & Retail'],
       ['Ken Griffin', '$27,200,000,000', 53, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['Tadashi Yanai & family', '$26,100,000,000', 73, 'Japan',
        'fashion retail', 'Fashion & Retail'],
       ['William Lei Ding', '$25,200,000,000', 50, 'China',
        'online games', 'Technology'],
       ['Susanne Klatten', '$24,300,000,000', 59, 'Germany',
        'BMW, pharmaceuticals', 'Automotive'],
       ['Cyrus Poonawalla', '$24,300,000,000', 80, 'India', 'vaccines',
        'Healthcare'],
       ['Wang Wei', '$24,300,000,000', 51, 'China', 'package delivery',
        'Service'],
       ['Qin Yinglin', '$24,100,000,000', 56, 'China', 'pig breeding',
        'Food & Beverage'],
       ['Sam Bankman-Fried', '$24,000,000,000', 30, 'United States',
        'cryptocurrency exchange', 'Finance & Investments'],
       ['Takemitsu Takizaki', '$23,900,000,000', 76, 'Japan', 'sensors',
        'Manufacturing'],
       ['Li Shufu', '$23,700,000,000', 58, 'China', 'automobiles',
        'Automotive'],
       ['Emmanuel Besnier', '$23,500,000,000', 51, 'France', 'cheese',
        'Food & Beverage'],
       ['R. Budi Hartono', '$23,200,000,000', 81, 'Indonesia',
        'banking, tobacco', 'Finance & Investments'],
       ['Leonard Lauder', '$23,100,000,000', 89, 'United States',
        'Estee Lauder', 'Fashion & Retail'],
       ['Guillaume Pousaz', '$23,000,000,000', 40, 'Switzerland',
        'fintech', 'Finance & Investments'],
       ['Iris Fontbona & family', '$22,800,000,000', 79, 'Chile',
        'mining', 'Metals & Mining'],
       ['Jack Ma', '$22,800,000,000', 57, 'China', 'e-commerce',
        'Technology'],
       ['Michael Hartono', '$22,300,000,000', 82, 'Indonesia',
        'banking, tobacco', 'Manufacturing'],
       ['Eric Schmidt', '$22,100,000,000', 66, 'United States', 'Google',
        'Technology'],
       ['Ray Dalio', '$22,000,000,000', 72, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['Daniel Gilbert', '$22,000,000,000', 60, 'United States',
        'Quicken Loans', 'Finance & Investments'],
       ['Thomas Frist, Jr. & family', '$21,800,000,000', 83,
        'United States', 'hospitals', 'Healthcare'],
       ['Masayoshi Son', '$21,300,000,000', 64, 'Japan',
        'internet, telecom', 'Telecom'],
       ['Abigail Johnson', '$21,200,000,000', 60, 'United States',
        'money management', 'Finance & Investments'],
       ['Rupert Murdoch & family', '$20,800,000,000', 91,
        'United States', 'newspapers, TV network',
        'Media & Entertainment'],
       ['Stefan Quandt', '$20,700,000,000', 55, 'Germany', 'BMW',
        'Automotive'],
       ['Jensen Huang', '$20,600,000,000', 59, 'United States',
        'semiconductors', 'Technology'],
       ['Huang Shilin', '$20,300,000,000', 55, 'China', 'batteries',
        'Automotive'],
       ['Thomas Peterffy', '$20,100,000,000', 77, 'United States',
        'discount brokerage', 'Finance & Investments'],
       ['Radhakishan Damani', '$20,000,000,000', 67, 'India',
        'retail, investments', 'Fashion & Retail'],
       ['Pang Kang', '$19,600,000,000', 66, 'China', 'soy sauce',
        'Food & Beverage'],
       ['Wang Chuanfu', '$19,500,000,000', 56, 'China',
        'batteries, automobiles', 'Automotive'],
       ['Reinhold Wuerth & family', '$19,000,000,000', 86, 'Germany',
        'fasteners', 'Manufacturing'],
       ['Theo Albrecht, Jr. & family', '$18,700,000,000', 71, 'Germany',
        "Aldi, Trader Joe's", 'Fashion & Retail'],
       ['Yang Huiyan & family', '$18,700,000,000', 40, 'China',
        'real estate', 'Real Estate'],
       ['Vladimir Lisin', '$18,400,000,000', 65, 'Russia',
        'steel, transport', 'Metals & Mining'],
       ['Fan Hongwei & family', '$18,200,000,000', 55, 'China',
        'petrochemicals', 'Energy'],
       ['Lakshmi Mittal', '$17,900,000,000', 71, 'India', 'steel',
        'Metals & Mining'],
       ['Andrew Forrest', '$17,800,000,000', 60, 'Australia', 'mining',
        'Metals & Mining'],
       ['Jiang Rensheng & family', '$17,700,000,000', 68, 'China',
        'vaccines', 'Healthcare'],
       ['Savitri Jindal & family', '$17,700,000,000', 72, 'India',
        'steel', 'Metals & Mining'],
       ['Wang Wenyin', '$17,700,000,000', 54, 'China',
        'mining, copper products', 'Metals & Mining'],
       ['Li Xiting', '$17,600,000,000', 71, 'Singapore',
        'medical devices', 'Healthcare'],
       ['Stefan Persson', '$17,600,000,000', 74, 'Sweden', 'H&M',
        'Fashion & Retail'],
       ['Steve Cohen', '$17,400,000,000', 65, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['Vladimir Potanin', '$17,300,000,000', 61, 'Russia', 'metals',
        'Metals & Mining'],
       ['Harold Hamm & family', '$17,200,000,000', 76, 'United States',
        'oil & gas', 'Energy'],
       ['Sun Piaoyang', '$17,100,000,000', 63, 'China',
        'pharmaceuticals', 'Healthcare'],
       ['Luo Liguo & family', '$17,000,000,000', 66, 'China',
        'chemicals', 'Manufacturing'],
       ['Peter Woo', '$17,000,000,000', 75, 'Hong Kong', 'real estate',
        'Real Estate']], dtype=object)

In [260]:
import pandas as pd

In [262]:
series = pd.Series( [100,200,300] )
series

0    100
1    200
2    300
dtype: int64

In [ ]:
#we create our data and our dataframe is df 
data= {'a':[100,200,300], 'b':[400,500,600], 'c':[700,800,900]}
df= pd.DataFrame(data)
df

     a    b    c
0  100  400  700
1  200  500  800
2  300  600  900

In [ ]:
#sums each value per column and return a series 
# we can write axis=0 
df.sum()

a     600
b    1500
c    2400
dtype: int64

In [ ]:
#will sum thing up horizontaly (columns) 
#or we can write axis=1 
df.sum(axis='columns')

0    1200
1    1500
2    1800
dtype: int64

In [ ]:
#we just import the data set path 
dataset=r'C:\Users\IDEAL INFO\Documents\data_pipelines\imdb_top_1000.csv'

In [273]:
import pandas as pd

In [285]:
#specify the columns we want 
cols= ['Series_Title', 'IMDB_Rating', 'No_of_Votes', 'Gross', 'Released_Year','Genre']

In [287]:
#read the dataset  and i specified which columns i need 
movies= pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\imdb_top_1000.csv' , usecols = cols) 
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,"30,500,000"
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [ ]:
#gives us a lod of information / types/ whether we're missing values/ shows us the memory usage .. 
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Series_Title   1000 non-null   object
 1   Released_Year  1000 non-null   object
 2   Genre          1000 non-null   object
 3   IMDB_Rating    1000 non-null   float64
 4   No_of_Votes    1000 non-null   int64
 5   Gross          831 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 47.0+ KB

In [ ]:
#just for numerical type ,for exemple the gros is defined as object , so that's why is no included 
movies.describe().round()

       IMDB_Rating  No_of_Votes
count       1000.0       1000.0
mean           8.0     273693.0
std            0.0     327373.0
min            8.0      25088.0
25%            8.0      55526.0
50%            8.0     138548.0
75%            8.0     374161.0
max            9.0    2343110.0

In [ ]:
#replace each comma with nothing 
movies['Gross'] = movies ['Gross'].str.replace(',','')
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,28341469
1,The Godfather,1972,"Crime, Drama",9.2,1620367,134966411
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,534858444
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,57300000
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,4360000
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,30500000
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [300]:
#convert data into an integer so we can use it as numeric data 
# and all null values replaced by 0 . 
movies['Gross'].fillna(0, inplace=True)
movies['Gross']  = movies['Gross'] .astype ('int64')
movies

C:\Users\IDEAL INFO\AppData\Local\Temp\ipykernel_22260\3870910997.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  movies['Gross'].fillna(0, inplace=True)

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,28341469
1,The Godfather,1972,"Crime, Drama",9.2,1620367,134966411
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,534858444
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,57300000
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,4360000
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,0
996,Giant,1956,"Drama, Western",7.6,34075,0
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,30500000
998,Lifeboat,1944,"Drama, War",7.6,26471,0
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,0

In [303]:
# now gross is available because we changed his type as a numeric one  
movies.describe().round()

       IMDB_Rating  No_of_Votes        Gross
count       1000.0       1000.0       1000.0
mean           8.0     273693.0   56536878.0
std            0.0     327373.0  103238179.0
min            8.0      25088.0          0.0
25%            8.0      55526.0     445710.0
50%            8.0     138548.0   10702752.0
75%            8.0     374161.0   61539891.0
max            9.0    2343110.0  936662225.0

In [306]:
#we can use movies.count to get the total of all the elments 
movies.count()

Series_Title     1000
Released_Year    1000
Genre            1000
IMDB_Rating      1000
No_of_Votes      1000
Gross            1000
dtype: int64

In [317]:
#calculate the avg for numerical types only 
movies.mean(numeric_only=True).round()

IMDB_Rating           8.0
No_of_Votes      273693.0
Gross          56536878.0
dtype: float64

In [318]:
#calculate the max for numerical types only 

movies.max(numeric_only=True).round()

IMDB_Rating            9.0
No_of_Votes      2343110.0
Gross          936662225.0
dtype: float64

In [321]:
#calculate the min for numerical types only 
movies.min(numeric_only=True).round()

IMDB_Rating        8.0
No_of_Votes    25088.0
Gross              0.0
dtype: float64

In [323]:
#we defined the quantile to be 50% 
movies.quantile(q=.5,numeric_only=True).round(2)

IMDB_Rating           7.9
No_of_Votes      138548.5
Gross          10702751.5
Name: 0.5, dtype: float64

In [328]:
#we include the string type in our rslt 
#except this time it's going to be recording the  strings .
movies.describe(include=['O'])

       Series_Title Released_Year  Genre
count          1000          1000   1000
unique          999           100    202
top        Drishyam          2014  Drama
freq              2            32     85